/* Unknown error */

"Detail 1024" = "An unknown error occurred. If you were looking for more ihnformation, it doesn't look to be the right place.";

/* Can't create folder */

"Detail 1025" = "An error occurred while trying to create the folder. Please check that permissions are correct or that the Finder Lock flag is not set on the parent folder.";

/* Can't create file */

"Detail 1026" = "An error occurred while trying to create the file. Please check that permissions are correct or that the Finder Lock flag is not set on the parent folder.";

/* Can't copy file */

"Detail 1027" = "An error occurred while trying to copy the item. Please check that permissions are correct for the source and destination. It might be a good idea to check that the source and the destination exist.";

/* Can't remove file */

"Detail 1028" = "An error occurred while trying to remove the file. Please check that permissions are correct or that the Finder Lock flag is not set.";

/* File does not exist */

"Detail 1029" = "This file does not exist at this location. Reminder: Missing files in a project are highlighted in red in the project.";

/* Incorrect File Type */

"Detail 1030" = "The file type is incorrect.";

/* Insufficient Privileges */

"Detail 1031" = "You don't have enough privileges to perform this operation. If you're playing with a mounted Disk Volume, this problem may happens. It is recommeded to only work with local disks.";

/* Insufficient Privileges Set */

"Detail 1032" = "An error occurred when trying to set appropriate permissions on a file or folder. If you're playing with a mounted Disk Volume, this problem may happens. It is recommeded to only work with local disks.";

/* Missing Information */

"Detail 1033" = "Some information are missing in the hierarchy of the project. Your project file might be corrupted. As Iceberg project files are XML property list file and the file format is documented, you may be able to fix the file with a text editor.";

/* Out of Memory */

"Detail 1034" = "The computer is running out of memory. Since this is a very uncommon error, you may seriously need to consider adding some RAMs to your system.";

/* Packages have same name */

"Detail 1035" = "At least 2 packages of a metapackage have the same name. You need to set a unique name for a package.";

/* Pax failed */

"Detail 1036" = "The creation of the pax archive failed. Check that you did not set some strange permissions, owners or group on the archive files.\nPlease note that pax is not compatible with ACLs. To check whether ACLs are enabled or not on your system, run 'fsaclctl -p /' in the Terminal.";

/* Bom failed */

"Detail 1037" = "The creation of the bom file failed. Check that you did not set some strange permissions, owners or group on the archive files.";

/* Can't clean folder */

"Detail 1038" = "An error occurred while cleaning the temporary folder used to build the project. The built projet is ok, though.";

/* Scratch folder does not exist */

"Detail 1039" = "The Scratch Folder does not exist at the indicated location.";

/* Missing License Template */

"Detail 1040" = "The license template is missing. Please check that your installation of Iceberg is correct. You may have to re-install Iceberg.";

/* Can't write file */

"Detail 1041" = "An error occurred while trying to write the file on disk. Check that there is enough space available on disk and that the permissions are ok";

/* Folder does not exist */

"Detail 1042" = "The folder does not exist on disk.";

/* Missing Split Foks tool */

"Detail 1043" = "The tool you selected to split forks can not be found on the disk. Reminder: The SplitForks tool is only available if you installed the Developer Tools.";

/* Split forks on non HFS Volume */

"Detail 1044" = "It is not possible to split forks on a non HFS volume. If your Scratch folder is on a mounted AppleShare volume, please note that AppleShare volumes are not seen as HFS volume by Mac OS X.";

/* Split forks error */

"Detail 1045" = "An unknown error occurred while running the split operation.";